rawpareto/sysbench-psmdb-3.0-ft-2000000-16-oltp.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Threads started!

setting write concern to 1
[  10s] threads: 16, tps: 1773.21, reads: 9960.65, writes: 5319.83, response time: 17.59ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 16, tps: 944.00, reads: 5306.09, writes: 2831.99, response time: 28.45ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 16, tps: 753.80, reads: 4228.41, writes: 2261.81, response time: 36.08ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 16, tps: 721.60, reads: 4068.10, writes: 2164.60, response time: 37.37ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 16, tps: 721.20, reads: 4058.70, writes: 2163.80, response time: 37.87ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 16, tps: 725.90, reads: 4055.80, writes: 2177.80, response time: 37.57ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 16, tps: 745.70, reads: 4175.70, writes: 2236.70, response time: 37.59ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 16, tps: 725.60, reads: 4071.30, writes: 2177.30, response time: 38.01ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 16, tps: 750.30, reads: 4213.90, writes: 2250.90, response time: 37.25ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 16, tps: 750.30, reads: 4215.00, writes: 2251.00, response time: 37.54ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 16, tps: 739.00, reads: 4137.60, writes: 2216.40, response time: 37.55ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 16, tps: 752.90, reads: 4243.80, writes: 2258.70, response time: 37.25ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 16, tps: 744.90, reads: 4172.70, writes: 2234.90, response time: 37.61ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 16, tps: 759.40, reads: 4250.00, writes: 2277.90, response time: 36.29ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 16, tps: 745.90, reads: 4186.80, writes: 2237.70, response time: 36.48ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 16, tps: 742.70, reads: 4163.80, writes: 2228.60, response time: 38.04ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 16, tps: 750.40, reads: 4200.10, writes: 2251.90, response time: 37.23ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 16, tps: 748.10, reads: 4175.60, writes: 2243.20, response time: 37.89ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 16, tps: 766.90, reads: 4296.10, writes: 2300.60, response time: 35.95ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 16, tps: 780.70, reads: 4365.60, writes: 2342.40, response time: 35.59ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 16, tps: 764.40, reads: 4290.10, writes: 2293.00, response time: 36.32ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 16, tps: 766.40, reads: 4297.00, writes: 2299.20, response time: 36.41ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 16, tps: 776.50, reads: 4348.50, writes: 2329.50, response time: 35.79ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 16, tps: 780.30, reads: 4370.09, writes: 2341.39, response time: 36.00ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 16, tps: 771.90, reads: 4320.90, writes: 2315.30, response time: 36.30ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 16, tps: 763.50, reads: 4268.10, writes: 2290.30, response time: 36.25ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 16, tps: 772.60, reads: 4339.81, writes: 2318.21, response time: 36.22ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 16, tps: 772.20, reads: 4339.50, writes: 2316.00, response time: 35.98ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 16, tps: 779.00, reads: 4382.30, writes: 2337.70, response time: 36.10ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 16, tps: 775.60, reads: 4342.40, writes: 2326.90, response time: 36.09ms (95%), errors: 0.00, reconnects:  0.00
[ 310s] threads: 16, tps: 780.20, reads: 4380.70, writes: 2340.00, response time: 35.82ms (95%), errors: 0.00, reconnects:  0.00
[ 320s] threads: 16, tps: 807.90, reads: 4539.30, writes: 2423.50, response time: 35.66ms (95%), errors: 0.00, reconnects:  0.00
[ 330s] threads: 16, tps: 775.40, reads: 4368.30, writes: 2326.30, response time: 36.20ms (95%), errors: 0.00, reconnects:  0.00
[ 340s] threads: 16, tps: 801.50, reads: 4506.90, writes: 2404.80, response time: 35.86ms (95%), errors: 0.00, reconnects:  0.00
[ 350s] threads: 16, tps: 788.30, reads: 4417.90, writes: 2365.90, response time: 35.89ms (95%), errors: 0.00, reconnects:  0.00
[ 360s] threads: 16, tps: 790.10, reads: 4431.40, writes: 2369.30, response time: 35.93ms (95%), errors: 0.00, reconnects:  0.00
[ 370s] threads: 16, tps: 781.90, reads: 4397.60, writes: 2345.50, response time: 36.23ms (95%), errors: 0.00, reconnects:  0.00
[ 380s] threads: 16, tps: 811.00, reads: 4567.72, writes: 2433.21, response time: 35.59ms (95%), errors: 0.00, reconnects:  0.00
[ 390s] threads: 16, tps: 808.10, reads: 4518.98, writes: 2424.49, response time: 35.61ms (95%), errors: 0.00, reconnects:  0.00
[ 400s] threads: 16, tps: 796.90, reads: 4461.40, writes: 2390.70, response time: 35.75ms (95%), errors: 0.00, reconnects:  0.00
[ 410s] threads: 16, tps: 792.80, reads: 4452.10, writes: 2378.50, response time: 36.03ms (95%), errors: 0.00, reconnects:  0.00
[ 420s] threads: 16, tps: 799.80, reads: 4490.50, writes: 2398.90, response time: 35.93ms (95%), errors: 0.00, reconnects:  0.00
[ 430s] threads: 16, tps: 783.60, reads: 4408.20, writes: 2350.90, response time: 36.12ms (95%), errors: 0.00, reconnects:  0.00
[ 440s] threads: 16, tps: 802.40, reads: 4496.60, writes: 2407.30, response time: 35.86ms (95%), errors: 0.00, reconnects:  0.00
[ 450s] threads: 16, tps: 815.60, reads: 4568.60, writes: 2446.60, response time: 35.06ms (95%), errors: 0.00, reconnects:  0.00
[ 460s] threads: 16, tps: 1133.90, reads: 6339.20, writes: 3402.20, response time: 29.81ms (95%), errors: 0.00, reconnects:  0.00
[ 470s] threads: 16, tps: 1384.80, reads: 7769.00, writes: 4154.40, response time: 23.13ms (95%), errors: 0.00, reconnects:  0.00
[ 480s] threads: 16, tps: 1369.50, reads: 7674.70, writes: 4108.30, response time: 23.30ms (95%), errors: 0.00, reconnects:  0.00
[ 490s] threads: 16, tps: 1380.00, reads: 7739.30, writes: 4139.70, response time: 23.40ms (95%), errors: 0.00, reconnects:  0.00
[ 500s] threads: 16, tps: 1358.20, reads: 7600.50, writes: 4074.60, response time: 23.44ms (95%), errors: 0.00, reconnects:  0.00
[ 510s] threads: 16, tps: 1392.80, reads: 7805.50, writes: 4178.40, response time: 22.81ms (95%), errors: 0.00, reconnects:  0.00
[ 520s] threads: 16, tps: 1381.00, reads: 7764.30, writes: 4143.20, response time: 23.01ms (95%), errors: 0.00, reconnects:  0.00
[ 530s] threads: 16, tps: 1378.30, reads: 7747.70, writes: 4134.70, response time: 23.17ms (95%), errors: 0.00, reconnects:  0.00
[ 540s] threads: 16, tps: 1411.50, reads: 7893.10, writes: 4234.80, response time: 22.64ms (95%), errors: 0.00, reconnects:  0.00
[ 550s] threads: 16, tps: 1421.60, reads: 7964.00, writes: 4264.70, response time: 22.62ms (95%), errors: 0.00, reconnects:  0.00
[ 560s] threads: 16, tps: 1436.90, reads: 8063.50, writes: 4310.70, response time: 21.88ms (95%), errors: 0.00, reconnects:  0.00
[ 570s] threads: 16, tps: 1427.70, reads: 8009.00, writes: 4283.50, response time: 22.66ms (95%), errors: 0.00, reconnects:  0.00
[ 580s] threads: 16, tps: 1435.20, reads: 8065.30, writes: 4305.20, response time: 22.43ms (95%), errors: 0.00, reconnects:  0.00
[ 590s] threads: 16, tps: 1448.80, reads: 8176.70, writes: 4346.10, response time: 21.94ms (95%), errors: 0.00, reconnects:  0.00
[ 600s] threads: 16, tps: 1433.70, reads: 8025.30, writes: 4301.20, response time: 22.43ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            3174906
        write:                           1697877
        other:                           565959
        total:                           5438742
    transactions:                        565959 (943.25 per sec.)
    read/write requests:                 4872783 (8121.18 per sec.)
    other operations:                    565959 (943.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0092s
    total number of events:              565959
    total time taken by event execution: 9599.1151s
    response time:
         min:                                  1.73ms
         avg:                                 16.96ms
         max:                                 79.23ms
         approx.  95 percentile:              33.88ms

Threads fairness:
    events (avg/stddev):           35372.4375/155.23
    execution time (avg/stddev):   599.9447/0.00